# FabricParamMajorLapspliceLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamMajorLapspliceLength Property
ParameterTypeId Class See Also
---
"Major Lap Splice Length": Fabric lap splice length in major direction in the fabric distribution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamMajorLapspliceLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamMajorLapspliceLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamMajorLapspliceLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace